app/controllers/build_controller.rb

  def index
    @news = News.all
    @publics = Public.all
    @events = Event.all
---
SELECT "news".* FROM "news"
SELECT "publics".* FROM "publics"
SELECT "events".* FROM "events"

  def preview
    @news = News.all
    @publics = Public.all
    @events = Event.all
---
SELECT "news".* FROM "news"
SELECT "publics".* FROM "publics"
SELECT "events".* FROM "events"