app/controllers/news_controller.rb

  def index
    @news = News.all
---
SELECT "news".* FROM "news"

  def show
    @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @news = News.new(params[:news])

    respond_to do |format|
      if @news.save
---
INSERT INTO "news" ("archived", "body", "created_at", "image", "position", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @news = News.find(params[:id])

    respond_to do |format|
      if @news.update_attributes(params[:news])
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "news" SET "position" = 35, "body" = '', "updated_at" = '2013-01-29 08:21:59.466890' WHERE "news"."id" = 1

  def destroy
    @news = News.find(params[:id])
    @news.destroy
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 4]]