app/controllers/publics_controller.rb

SELECT "publics".* FROM "publics"
---
  def index
    @publics = Public.all

SELECT "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @public = Public.find(params[:id])

SELECT "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @public = Public.find(params[:id])

INSERT INTO "publics" ("archived", "body", "created_at", "position", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @public = Public.new(params[:public])

    respond_to do |format|
      if @public.save